tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'jenkins-x/jx'
tap 'AdoptOpenJDK/openjdk'
tap 'boz/repo'
tap 'weaveworks/tap'
tap 'AdoptOpenJDK/openjdk'

brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'zsh-completions'
brew 'tree'
brew 'pstree'
brew 'grep'
brew 'certbot'
brew 'plantuml'
brew 'minio-mc'
brew 'lsd'
brew 'fd'
brew 'pgcli'
brew 'iredis'

brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'
brew 'grep'

brew 'findutils'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnutls'
brew 'grep'
brew 'gnu-tar'
brew 'gawk'

brew 'autoconf'
brew 'automake'
brew 'libtool'
brew 'gnu-getopt'
brew 'shellcheck'

brew 'circleci'
brew 'npm'
#brew 'nvm'
brew 'openssl'
brew 'gpg'
#brew 'https://raw.githubusercontent.com/kadwanev/bigboybrew/master/Library/Formula/sshpass.rb'
#brew install 'https://raw.githubusercontent.com/kadwanev/bigboybrew/master/Library/Formula/sshpass.rb'

brew 'libjwt'

brew tap mike-engel/jwt-cli
brew install jwt-cli

cask 'keybase'

brew 'wget'
brew 'httpie'
brew 'markdown'

cask 'google-chrome'
cask 'brave-browser'
cask 'tor-browser'
cask 'insomnia'
brew 'iterm2'

brew 'awscli'
brew 'aws-iam-authenticator'
brew 'awslogs'
brew 'docker-credential-helper-ecr'
cask 'google-cloud-sdk'
brew 'rpm'
brew 'git'
brew 'diff-so-fancy'
brew 'hub'
brew 'git-flow-avh'
brew 'git-subrepo'
brew 'pre-commit'
cask 'fork'

cask 'sourcetree'

brew 'maven'
brew 'yarn'
brew 'nvm'
brew 'ant'
brew 'sbt'
brew 'gradle'
brew 'jx'
brew 'hyperkit'

brew 'ruby'
brew 'python'
brew 'scala'
brew 'go'
brew 'dep'
brew 'rust'
brew 'groovy'
brew 'jvmtop'

cask 'adoptopenjdk'
cask 'adoptopenjdk8'
cask 'adoptopenjdk10'
cask 'adoptopenjdk11'
cask 'adoptopenjdk12'
cask 'adoptopenjdk14'
brew 'bazel'
brew 'docker-completion'
brew 'docker-machine-driver-hyperkit'
brew 'docker'
brew 'kubectl'
brew 'txn2/tap/kubefwd'
brew 'weaveworks/tap/eksctl'
brew 'helm'
#brew 'helm@2'
brew 'helmfile'
brew 'sops'
brew 'derailed/k9s/k9s'
brew 'derailed/popeye/popeye'
brew 'kubectx'
brew 'kube-ps1'
brew 'stern'
#tap farmotive/k8s
brew 'kpoof'
brew 'boz/repo/kail'
brew 'cassandra'
brew 'kafka'
brew 'apache-flink'
brew 'kafkacat'
brew 'hadoop'
brew 'hbase'
brew 'zookeeper'
brew 'apache-spark'
brew 'mysql'
brew 'postgresql'
cask 'dbeaver-community'
brew 'pgcli'
cask 'postico'
cask 'pgadmin4'
brew 'postgis'
brew 'redis'
cask 'pycharm-ce'
cask 'intellij-idea-ce'
cask 'visualvm'
cask 'rubymine'
cask 'atom'
brew 'packer'
brew 'consul'
brew 'terraform'
brew 'nomad'
brew 'serf'
brew 'vault'
brew 'ansible'
brew 'nmap'
brew 'graphviz'
brew 'neo4j'
cask 'slack'
brew 'jq'
brew 'oq'
brew 'yq'
brew 'miller'
brew 'watch'
cask 'iterm2'
cask 'coolterm'
cask 'tunnelblick'
cask 'tftpserver'

brew 'gnu-sed' #, args: ['with-default-names']
brew 'unzip' #, args: ['with-default-names']

cask 'the-unarchiver'
cask 'etcher'

brew 'coreutils'
brew 'binutils'
brew 'inetutils'
brew 'arp-scan'
brew 'iproute2mac'
brew 'expect'
brew 'tmux'
brew 'tmux-xpanes'
brew 'tmate'
brew 'pidof'

cask 'visual-studio-code'

brew 'mas'
