tap 'homebrew/bundle'
#tap 'homebrew/fuse'
tap 'caskroom/cask'
tap 'caskroom/drivers'
tap 'caskroom/fonts'
#tap 'caskroom/versions'
tap 'jenkins-x/jx'
tap 'AdoptOpenJDK/openjdk'
tap 'boz/repo'
tap 'apjanke/ronn-ag'
tap 'weaveworks/tap'

brew 'bash'
brew 'bash-completion'
brew 'tree'
brew 'grep'
brew 'ronn-ng'

brew 'autoconf'
brew 'automake'
brew 'libtool'
brew 'gnu-getopt'
brew 'shellcheck'

brew 'circleci'
brew 'npm'
#brew 'nvm'
brew 'openssl'
brew 'gpg'
#brew 'https://raw.githubusercontent.com/kadwanev/bigboybrew/master/Library/Formula/sshpass.rb'
#brew install 'https://raw.githubusercontent.com/kadwanev/bigboybrew/master/Library/Formula/sshpass.rb'

brew 'libjwt'

cask 'keybase'

brew 'wget'
brew 'markdown'

cask 'google-chrome'
cask 'brave-browser'
cask 'tor-browser'
cask 'insomnia'

brew 'awscli'
brew 'awslogs'
cask 'google-cloud-sdk'
brew 'rpm'
brew 'git'
brew 'hub'
brew 'git-flow-avh'
brew 'git-subrepo'
brew 'subversion'
brew 'mercurial'

cask 'sourcetree'

brew 'maven'
brew 'ant'
brew 'sbt'
brew 'gradle'
brew 'jx'
brew 'hyperkit'

brew 'ruby'
brew 'python'
brew 'scala'
brew 'go'
brew 'rust'
brew 'groovy'
brew 'jvmtop'

cask 'java'
cask 'java8'
cask 'java'
cask 'adoptopenjdk'
cask 'adoptopenjdk8'
cask 'adoptopenjdk10'
cask 'adoptopenjdk11'
cask 'adoptopenjdk12'
brew 'docker-completion'
brew 'docker-machine-driver-hyperkit'
brew 'docker'
brew 'kubectl'
#brew 'weaveworks/tap/eksctl'
brew 'kubernetes-helm'
cask 'minikube'
brew 'boz/repo/kail'
brew 'cassandra'
brew 'hadoop'
brew 'hbase'
brew 'zookeeper'
brew 'apache-spark'
brew 'mysql'
brew 'postgresql'
cask 'pgadmin4'
brew 'postgis'
brew 'redis'
brew 'titan-server'
cask 'pycharm-ce'
cask 'intellij-idea-ce'
cask 'visualvm'
cask 'rubymine'
cask 'atom'
brew 'packer'
brew 'consul'
brew 'terraform'
brew 'nomad'
brew 'serf'
brew 'vault'
brew 'ansible'
brew 'nmap'
brew 'graphviz'
brew 'neo4j'
cask 'vagrant'
cask 'vagrant-manager'
cask 'slack'
cask 'skype'
cask 'limechat'
cask 'hipchat'
brew 'jq'
brew 'watch'
cask 'coolterm'
cask 'tunnelblick'
cask 'tftpserver'
cask 'xquartz'

brew 'gnu-sed', args: ['with-default-names']
brew 'unzip', args: ['with-default-names']

cask 'ticktick'
cask 'the-unarchiver'
cask 'etcher'

brew 'coreutils'
brew 'binutils'
brew 'inetutils'
brew 'arp-scan'
brew 'iproute2mac'
brew 'expect'
brew 'tmux-xpanes'
brew 'pidof'

cask 'keybase'
cask 'visual-studio-code'

brew 'mas'
